separation of the capacity evaluation and the solution evaluation
